testing_carga/artillery_ejem2/load-test.yml
config:
  environments:
    production:
      target: "http://www.items.es"
      phases:
        - duration: 120
          arrivalRate: 10
    staging:
      target: "http://127.0.0.1:8080"
      phases:
        - duration: 20
          arrivalRate: 10
scenarios:
  - flow:
    - get:
        url: "/items/"